Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>AFIR1_16BIT</name>
          <displayName>AFIR1_16BIT</displayName>
          <description>Acceptance Filter ID Register1</description>
          <alternateRegister>AFIR1_32BIT</alternateRegister>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AI1IDH</name>
              <description>AI1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI1IDE</name>
              <description>AI1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1RTR</name>
              <description>AI1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1IDL</name>
              <description>AI1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AI2IDH</name>
              <description>AI2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI2IDE</name>
              <description>AI2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2RTR</name>
              <description>AI2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2IDL</name>
              <description>AI2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR2_32BIT</name>
          <displayName>AFMR2_32BIT</displayName>
          <description>Acceptance Filter Mask Register2</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDL</name>
              <description>AMIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDH</name>
              <description>AMIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR2_16BIT</name>
          <displayName>AFMR2_16BIT</displayName>
          <description>Acceptance Filter Mask Register2</description>
          <alternateRegister>AFMR2_32BIT</alternateRegister>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM1IDH</name>
              <description>AM1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM1IDE</name>
              <description>AM1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1RTR</name>
              <description>AM1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1IDL</name>
              <description>AM1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AM2IDH</name>
              <description>AM2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM2IDE</name>
              <description>AM2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2RTR</name>
              <description>AM2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2IDL</name>
              <description>AM2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR2_32BIT</name>
          <displayName>AFIR2_32BIT</displayName>
          <description>Acceptance Filter ID Register2</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDL</name>
              <description>AIIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDH</name>
              <description>AIIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR2_16BIT</name>
          <displayName>AFIR2_16BIT</displayName>
          <description>Acceptance Filter ID Register2</description>
          <alternateRegister>AFIR2_32BIT</alternateRegister>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AI1IDH</name>
              <description>AI1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI1IDE</name>
              <description>AI1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1RTR</name>
              <description>AI1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1IDL</name>
              <description>AI1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AI2IDH</name>
              <description>AI2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI2IDE</name>
              <description>AI2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2RTR</name>
              <description>AI2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2IDL</name>
              <description>AI2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR3_32BIT</name>
          <displayName>AFMR3_32BIT</displayName>
          <description>Acceptance Filter Mask Register3</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDL</name>
              <description>AMIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDH</name>
              <description>AMIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR3_16BIT</name>
          <displayName>AFMR3_16BIT</displayName>
          <description>Acceptance Filter Mask Register3</description>
          <alternateRegister>AFMR3_32BIT</alternateRegister>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM1IDH</name>
              <description>AM1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM1IDE</name>
              <description>AM1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1RTR</name>
              <description>AM1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1IDL</name>
              <description>AM1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AM2IDH</name>
              <description>AM2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM2IDE</name>
              <description>AM2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2RTR</name>
              <description>AM2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2IDL</name>
              <description>AM2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR3_32BIT</name>
          <displayName>AFIR3_32BIT</displayName>
          <description>Acceptance Filter ID Register3</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDL</name>
              <description>AIIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDH</name>
              <description>AIIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR3_16BIT</name>
          <displayName>AFIR3_16BIT</displayName>
          <description>Acceptance Filter ID Register3</description>
          <alternateRegister>AFIR3_32BIT</alternateRegister>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AI1IDH</name>
              <description>AI1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI1IDE</name>
              <description>AI1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1RTR</name>
              <description>AI1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1IDL</name>
              <description>AI1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AI2IDH</name>
              <description>AI2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI2IDE</name>
              <description>AI2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2RTR</name>
              <description>AI2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2IDL</name>
              <description>AI2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR4_32BIT</name>
          <displayName>AFMR4_32BIT</displayName>
          <description>Acceptance Filter Mask Register4</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDL</name>
              <description>AMIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDH</name>
              <description>AMIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR4_16BIT</name>
          <displayName>AFMR4_16BIT</displayName>
          <description>Acceptance Filter Mask Register4</description>
          <alternateRegister>AFMR4_32BIT</alternateRegister>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM1IDH</name>
              <description>AM1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM1IDE</name>
              <description>AM1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1RTR</name>
              <description>AM1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1IDL</name>
              <description>AM1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AM2IDH</name>
              <description>AM2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM2IDE</name>
              <description>AM2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2RTR</name>
              <description>AM2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2IDL</name>
              <description>AM2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR4_32BIT</name>
          <displayName>AFIR4_32BIT</displayName>
          <description>Acceptance Filter ID Register4</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDL</name>
              <description>AIIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDH</name>
              <description>AIIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
