Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>AFIR7_16BIT</name>
          <displayName>AFIR7_16BIT</displayName>
          <description>Acceptance Filter ID Register7</description>
          <alternateRegister>AFIR7_32BIT</alternateRegister>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AI1IDH</name>
              <description>AI1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI1IDE</name>
              <description>AI1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1RTR</name>
              <description>AI1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1IDL</name>
              <description>AI1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AI2IDH</name>
              <description>AI2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI2IDE</name>
              <description>AI2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2RTR</name>
              <description>AI2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2IDL</name>
              <description>AI2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR8_32BIT</name>
          <displayName>AFMR8_32BIT</displayName>
          <description>Acceptance Filter Mask Register8</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDL</name>
              <description>AMIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDH</name>
              <description>AMIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR8_16BIT</name>
          <displayName>AFMR8_16BIT</displayName>
          <description>Acceptance Filter Mask Register8</description>
          <alternateRegister>AFMR8_32BIT</alternateRegister>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM1IDH</name>
              <description>AM1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM1IDE</name>
              <description>AM1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1RTR</name>
              <description>AM1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1IDL</name>
              <description>AM1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AM2IDH</name>
              <description>AM2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM2IDE</name>
              <description>AM2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2RTR</name>
              <description>AM2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2IDL</name>
              <description>AM2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR8_32BIT</name>
          <displayName>AFIR8_32BIT</displayName>
          <description>Acceptance Filter ID Register8</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDL</name>
              <description>AIIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDH</name>
              <description>AIIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR8_16BIT</name>
          <displayName>AFIR8_16BIT</displayName>
          <description>Acceptance Filter ID Register8</description>
          <alternateRegister>AFIR8_32BIT</alternateRegister>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AI1IDH</name>
              <description>AI1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI1IDE</name>
              <description>AI1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1RTR</name>
              <description>AI1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1IDL</name>
              <description>AI1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AI2IDH</name>
              <description>AI2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI2IDE</name>
              <description>AI2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2RTR</name>
              <description>AI2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2IDL</name>
              <description>AI2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR9_32BIT</name>
          <displayName>AFMR9_32BIT</displayName>
          <description>Acceptance Filter Mask Register9</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDL</name>
              <description>AMIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDH</name>
              <description>AMIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR9_16BIT</name>
          <displayName>AFMR9_16BIT</displayName>
          <description>Acceptance Filter Mask Register9</description>
          <alternateRegister>AFMR9_32BIT</alternateRegister>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM1IDH</name>
              <description>AM1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM1IDE</name>
              <description>AM1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1RTR</name>
              <description>AM1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1IDL</name>
              <description>AM1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AM2IDH</name>
              <description>AM2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM2IDE</name>
              <description>AM2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2RTR</name>
              <description>AM2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2IDL</name>
              <description>AM2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR9_32BIT</name>
          <displayName>AFIR9_32BIT</displayName>
          <description>Acceptance Filter ID Register9</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDL</name>
              <description>AIIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDH</name>
              <description>AIIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR9_16BIT</name>
          <displayName>AFIR9_16BIT</displayName>
          <description>Acceptance Filter ID Register9</description>
          <alternateRegister>AFIR9_32BIT</alternateRegister>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AI1IDH</name>
              <description>AI1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI1IDE</name>
              <description>AI1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1RTR</name>
              <description>AI1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI1IDL</name>
              <description>AI1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AI2IDH</name>
              <description>AI2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AI2IDE</name>
              <description>AI2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2RTR</name>
              <description>AI2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AI2IDL</name>
              <description>AI2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR10_32BIT</name>
          <displayName>AFMR10_32BIT</displayName>
          <description>Acceptance Filter Mask Register10</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AMRTR</name>
              <description>AMRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDL</name>
              <description>AMIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AMIDE</name>
              <description>AMIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMSRR</name>
              <description>AMSRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AMIDH</name>
              <description>AMIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFMR10_16BIT</name>
          <displayName>AFMR10_16BIT</displayName>
          <description>Acceptance Filter Mask Register10</description>
          <alternateRegister>AFMR10_32BIT</alternateRegister>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM1IDH</name>
              <description>AM1IDH field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM1IDE</name>
              <description>AM1IDE field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1RTR</name>
              <description>AM1RTR field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM1IDL</name>
              <description>AM1IDL field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
            <field>
              <name>AM2IDH</name>
              <description>AM2IDH field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>AM2IDE</name>
              <description>AM2IDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2RTR</name>
              <description>AM2RTR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AM2IDL</name>
              <description>AM2IDL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AFIR10_32BIT</name>
          <displayName>AFIR10_32BIT</displayName>
          <description>Acceptance Filter ID Register10</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIRTR</name>
              <description>AIRTR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDL</name>
              <description>AIIDL field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
            <field>
              <name>AIIDE</name>
              <description>AIIDE field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AISRR</name>
              <description>AISRR field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AIIDH</name>
              <description>AIIDH field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
            </field>
          </fields>
        </register>
