Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDRM7DF0</name>
          <displayName>CFDRM7DF0</displayName>
          <description>no description</description>
          <addressOffset>0xb40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF1</name>
          <displayName>CFDRM7DF1</displayName>
          <description>no description</description>
          <addressOffset>0xb44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF2</name>
          <displayName>CFDRM7DF2</displayName>
          <description>no description</description>
          <addressOffset>0xb48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF3</name>
          <displayName>CFDRM7DF3</displayName>
          <description>no description</description>
          <addressOffset>0xb4c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF4</name>
          <displayName>CFDRM7DF4</displayName>
          <description>no description</description>
          <addressOffset>0xb50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF5</name>
          <displayName>CFDRM7DF5</displayName>
          <description>no description</description>
          <addressOffset>0xb54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF6</name>
          <displayName>CFDRM7DF6</displayName>
          <description>no description</description>
          <addressOffset>0xb58</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF7</name>
          <displayName>CFDRM7DF7</displayName>
          <description>no description</description>
          <addressOffset>0xb5c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF8</name>
          <displayName>CFDRM7DF8</displayName>
          <description>no description</description>
          <addressOffset>0xb60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF9</name>
          <displayName>CFDRM7DF9</displayName>
          <description>no description</description>
          <addressOffset>0xb64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF10</name>
          <displayName>CFDRM7DF10</displayName>
          <description>no description</description>
          <addressOffset>0xb68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF11</name>
          <displayName>CFDRM7DF11</displayName>
          <description>no description</description>
          <addressOffset>0xb6c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF12</name>
          <displayName>CFDRM7DF12</displayName>
          <description>no description</description>
          <addressOffset>0xb70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF13</name>
          <displayName>CFDRM7DF13</displayName>
          <description>no description</description>
          <addressOffset>0xb74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF14</name>
          <displayName>CFDRM7DF14</displayName>
          <description>no description</description>
          <addressOffset>0xb78</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM7DF15</name>
          <displayName>CFDRM7DF15</displayName>
          <description>no description</description>
          <addressOffset>0xb7c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8ID</name>
          <displayName>CFDRM8ID</displayName>
          <description>no description</description>
          <addressOffset>0xd20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8PTR</name>
          <displayName>CFDRM8PTR</displayName>
          <description>no description</description>
          <addressOffset>0xd24</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8FDSTS</name>
          <displayName>CFDRM8FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0xd28</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF0</name>
          <displayName>CFDRM8DF0</displayName>
          <description>no description</description>
          <addressOffset>0xd2c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF1</name>
          <displayName>CFDRM8DF1</displayName>
          <description>no description</description>
          <addressOffset>0xd30</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF2</name>
          <displayName>CFDRM8DF2</displayName>
          <description>no description</description>
          <addressOffset>0xd34</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF3</name>
          <displayName>CFDRM8DF3</displayName>
          <description>no description</description>
          <addressOffset>0xd38</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF4</name>
          <displayName>CFDRM8DF4</displayName>
          <description>no description</description>
          <addressOffset>0xd3c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF5</name>
          <displayName>CFDRM8DF5</displayName>
          <description>no description</description>
          <addressOffset>0xd40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF6</name>
          <displayName>CFDRM8DF6</displayName>
          <description>no description</description>
          <addressOffset>0xd44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF7</name>
          <displayName>CFDRM8DF7</displayName>
          <description>no description</description>
          <addressOffset>0xd48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF8</name>
          <displayName>CFDRM8DF8</displayName>
          <description>no description</description>
          <addressOffset>0xd4c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF9</name>
          <displayName>CFDRM8DF9</displayName>
          <description>no description</description>
          <addressOffset>0xd50</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF10</name>
          <displayName>CFDRM8DF10</displayName>
          <description>no description</description>
          <addressOffset>0xd54</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF11</name>
          <displayName>CFDRM8DF11</displayName>
          <description>no description</description>
          <addressOffset>0xd58</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF12</name>
          <displayName>CFDRM8DF12</displayName>
          <description>no description</description>
          <addressOffset>0xd5c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF13</name>
          <displayName>CFDRM8DF13</displayName>
          <description>no description</description>
          <addressOffset>0xd60</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF14</name>
          <displayName>CFDRM8DF14</displayName>
          <description>no description</description>
          <addressOffset>0xd64</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM8DF15</name>
          <displayName>CFDRM8DF15</displayName>
          <description>no description</description>
          <addressOffset>0xd68</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9ID</name>
          <displayName>CFDRM9ID</displayName>
          <description>no description</description>
          <addressOffset>0xd6c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
