Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDRM9PTR</name>
          <displayName>CFDRM9PTR</displayName>
          <description>no description</description>
          <addressOffset>0xd70</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9FDSTS</name>
          <displayName>CFDRM9FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0xd74</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF0</name>
          <displayName>CFDRM9DF0</displayName>
          <description>no description</description>
          <addressOffset>0xd78</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF1</name>
          <displayName>CFDRM9DF1</displayName>
          <description>no description</description>
          <addressOffset>0xd7c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF2</name>
          <displayName>CFDRM9DF2</displayName>
          <description>no description</description>
          <addressOffset>0xd80</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF3</name>
          <displayName>CFDRM9DF3</displayName>
          <description>no description</description>
          <addressOffset>0xd84</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF4</name>
          <displayName>CFDRM9DF4</displayName>
          <description>no description</description>
          <addressOffset>0xd88</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF5</name>
          <displayName>CFDRM9DF5</displayName>
          <description>no description</description>
          <addressOffset>0xd8c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF6</name>
          <displayName>CFDRM9DF6</displayName>
          <description>no description</description>
          <addressOffset>0xd90</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF7</name>
          <displayName>CFDRM9DF7</displayName>
          <description>no description</description>
          <addressOffset>0xd94</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF8</name>
          <displayName>CFDRM9DF8</displayName>
          <description>no description</description>
          <addressOffset>0xd98</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF9</name>
          <displayName>CFDRM9DF9</displayName>
          <description>no description</description>
          <addressOffset>0xd9c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF10</name>
          <displayName>CFDRM9DF10</displayName>
          <description>no description</description>
          <addressOffset>0xda0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF11</name>
          <displayName>CFDRM9DF11</displayName>
          <description>no description</description>
          <addressOffset>0xda4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF12</name>
          <displayName>CFDRM9DF12</displayName>
          <description>no description</description>
          <addressOffset>0xda8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF13</name>
          <displayName>CFDRM9DF13</displayName>
          <description>no description</description>
          <addressOffset>0xdac</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF14</name>
          <displayName>CFDRM9DF14</displayName>
          <description>no description</description>
          <addressOffset>0xdb0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM9DF15</name>
          <displayName>CFDRM9DF15</displayName>
          <description>no description</description>
          <addressOffset>0xdb4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10ID</name>
          <displayName>CFDRM10ID</displayName>
          <description>no description</description>
          <addressOffset>0xdb8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10PTR</name>
          <displayName>CFDRM10PTR</displayName>
          <description>no description</description>
          <addressOffset>0xdbc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10FDSTS</name>
          <displayName>CFDRM10FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0xdc0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF0</name>
          <displayName>CFDRM10DF0</displayName>
          <description>no description</description>
          <addressOffset>0xdc4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF1</name>
          <displayName>CFDRM10DF1</displayName>
          <description>no description</description>
          <addressOffset>0xdc8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF2</name>
          <displayName>CFDRM10DF2</displayName>
          <description>no description</description>
          <addressOffset>0xdcc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF3</name>
          <displayName>CFDRM10DF3</displayName>
          <description>no description</description>
          <addressOffset>0xdd0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF4</name>
          <displayName>CFDRM10DF4</displayName>
          <description>no description</description>
          <addressOffset>0xdd4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF5</name>
          <displayName>CFDRM10DF5</displayName>
          <description>no description</description>
          <addressOffset>0xdd8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF6</name>
          <displayName>CFDRM10DF6</displayName>
          <description>no description</description>
          <addressOffset>0xddc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF7</name>
          <displayName>CFDRM10DF7</displayName>
          <description>no description</description>
          <addressOffset>0xde0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF8</name>
          <displayName>CFDRM10DF8</displayName>
          <description>no description</description>
          <addressOffset>0xde4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF9</name>
          <displayName>CFDRM10DF9</displayName>
          <description>no description</description>
          <addressOffset>0xde8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF10</name>
          <displayName>CFDRM10DF10</displayName>
          <description>no description</description>
          <addressOffset>0xdec</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF11</name>
          <displayName>CFDRM10DF11</displayName>
          <description>no description</description>
          <addressOffset>0xdf0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF12</name>
          <displayName>CFDRM10DF12</displayName>
          <description>no description</description>
          <addressOffset>0xdf4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM10DF13</name>
          <displayName>CFDRM10DF13</displayName>
          <description>no description</description>
          <addressOffset>0xdf8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
