Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDRM21DF11</name>
          <displayName>CFDRM21DF11</displayName>
          <description>no description</description>
          <addressOffset>0x12d4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF12</name>
          <displayName>CFDRM21DF12</displayName>
          <description>no description</description>
          <addressOffset>0x12d8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF13</name>
          <displayName>CFDRM21DF13</displayName>
          <description>no description</description>
          <addressOffset>0x12dc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF14</name>
          <displayName>CFDRM21DF14</displayName>
          <description>no description</description>
          <addressOffset>0x12e0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF15</name>
          <displayName>CFDRM21DF15</displayName>
          <description>no description</description>
          <addressOffset>0x12e4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22ID</name>
          <displayName>CFDRM22ID</displayName>
          <description>no description</description>
          <addressOffset>0x12e8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22PTR</name>
          <displayName>CFDRM22PTR</displayName>
          <description>no description</description>
          <addressOffset>0x12ec</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22FDSTS</name>
          <displayName>CFDRM22FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0x12f0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF0</name>
          <displayName>CFDRM22DF0</displayName>
          <description>no description</description>
          <addressOffset>0x12f4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF1</name>
          <displayName>CFDRM22DF1</displayName>
          <description>no description</description>
          <addressOffset>0x12f8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF2</name>
          <displayName>CFDRM22DF2</displayName>
          <description>no description</description>
          <addressOffset>0x12fc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF3</name>
          <displayName>CFDRM22DF3</displayName>
          <description>no description</description>
          <addressOffset>0x1300</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF4</name>
          <displayName>CFDRM22DF4</displayName>
          <description>no description</description>
          <addressOffset>0x1304</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF5</name>
          <displayName>CFDRM22DF5</displayName>
          <description>no description</description>
          <addressOffset>0x1308</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF6</name>
          <displayName>CFDRM22DF6</displayName>
          <description>no description</description>
          <addressOffset>0x130c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF7</name>
          <displayName>CFDRM22DF7</displayName>
          <description>no description</description>
          <addressOffset>0x1310</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF8</name>
          <displayName>CFDRM22DF8</displayName>
          <description>no description</description>
          <addressOffset>0x1314</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF9</name>
          <displayName>CFDRM22DF9</displayName>
          <description>no description</description>
          <addressOffset>0x1318</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF10</name>
          <displayName>CFDRM22DF10</displayName>
          <description>no description</description>
          <addressOffset>0x131c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF11</name>
          <displayName>CFDRM22DF11</displayName>
          <description>no description</description>
          <addressOffset>0x1320</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF12</name>
          <displayName>CFDRM22DF12</displayName>
          <description>no description</description>
          <addressOffset>0x1324</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF13</name>
          <displayName>CFDRM22DF13</displayName>
          <description>no description</description>
          <addressOffset>0x1328</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF14</name>
          <displayName>CFDRM22DF14</displayName>
          <description>no description</description>
          <addressOffset>0x132c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM22DF15</name>
          <displayName>CFDRM22DF15</displayName>
          <description>no description</description>
          <addressOffset>0x1330</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23ID</name>
          <displayName>CFDRM23ID</displayName>
          <description>no description</description>
          <addressOffset>0x1334</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23PTR</name>
          <displayName>CFDRM23PTR</displayName>
          <description>no description</description>
          <addressOffset>0x1338</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23FDSTS</name>
          <displayName>CFDRM23FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0x133c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF0</name>
          <displayName>CFDRM23DF0</displayName>
          <description>no description</description>
          <addressOffset>0x1340</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF1</name>
          <displayName>CFDRM23DF1</displayName>
          <description>no description</description>
          <addressOffset>0x1344</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF2</name>
          <displayName>CFDRM23DF2</displayName>
          <description>no description</description>
          <addressOffset>0x1348</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF3</name>
          <displayName>CFDRM23DF3</displayName>
          <description>no description</description>
          <addressOffset>0x134c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF4</name>
          <displayName>CFDRM23DF4</displayName>
          <description>no description</description>
          <addressOffset>0x1350</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF5</name>
          <displayName>CFDRM23DF5</displayName>
          <description>no description</description>
          <addressOffset>0x1354</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM23DF6</name>
          <displayName>CFDRM23DF6</displayName>
          <description>no description</description>
          <addressOffset>0x1358</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
