Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDGAFL8M</name>
          <displayName>CFDGAFL8M</displayName>
          <description>no description</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDEM</name>
              <description>GAFLIDEM field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTRM</name>
              <description>GAFLRTRM field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIFL1</name>
              <description>GAFLIFL1 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIDM</name>
              <description>GAFLIDM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL8P0</name>
          <displayName>CFDGAFL8P0</displayName>
          <description>no description</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLPTR</name>
              <description>GAFLPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>GAFLRMV</name>
              <description>GAFLRMV field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRMDP</name>
              <description>GAFLRMDP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GAFLIFL0</name>
              <description>GAFLIFL0 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLDLC</name>
              <description>GAFLDLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL8P1</name>
          <displayName>CFDGAFL8P1</displayName>
          <description>no description</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLFDPH</name>
              <description>GAFLFDPH field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLFDPL</name>
              <description>GAFLFDPL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL9ID</name>
          <displayName>CFDGAFL9ID</displayName>
          <description>no description</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDE</name>
              <description>GAFLIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTR</name>
              <description>GAFLRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLLB</name>
              <description>GAFLLB field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLID</name>
              <description>GAFLID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL9M</name>
          <displayName>CFDGAFL9M</displayName>
          <description>no description</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDEM</name>
              <description>GAFLIDEM field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTRM</name>
              <description>GAFLRTRM field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIFL1</name>
              <description>GAFLIFL1 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIDM</name>
              <description>GAFLIDM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL9P0</name>
          <displayName>CFDGAFL9P0</displayName>
          <description>no description</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLPTR</name>
              <description>GAFLPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>GAFLRMV</name>
              <description>GAFLRMV field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRMDP</name>
              <description>GAFLRMDP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GAFLIFL0</name>
              <description>GAFLIFL0 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLDLC</name>
              <description>GAFLDLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL9P1</name>
          <displayName>CFDGAFL9P1</displayName>
          <description>no description</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLFDPH</name>
              <description>GAFLFDPH field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLFDPL</name>
              <description>GAFLFDPL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL10ID</name>
          <displayName>CFDGAFL10ID</displayName>
          <description>no description</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDE</name>
              <description>GAFLIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTR</name>
              <description>GAFLRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLLB</name>
              <description>GAFLLB field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLID</name>
              <description>GAFLID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL10M</name>
          <displayName>CFDGAFL10M</displayName>
          <description>no description</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDEM</name>
              <description>GAFLIDEM field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTRM</name>
              <description>GAFLRTRM field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIFL1</name>
              <description>GAFLIFL1 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIDM</name>
              <description>GAFLIDM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL10P0</name>
          <displayName>CFDGAFL10P0</displayName>
          <description>no description</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLPTR</name>
              <description>GAFLPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>GAFLRMV</name>
              <description>GAFLRMV field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRMDP</name>
              <description>GAFLRMDP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GAFLIFL0</name>
              <description>GAFLIFL0 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLDLC</name>
              <description>GAFLDLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL10P1</name>
          <displayName>CFDGAFL10P1</displayName>
          <description>no description</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLFDPH</name>
              <description>GAFLFDPH field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLFDPL</name>
              <description>GAFLFDPL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL11ID</name>
          <displayName>CFDGAFL11ID</displayName>
          <description>no description</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDE</name>
              <description>GAFLIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTR</name>
              <description>GAFLRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLLB</name>
              <description>GAFLLB field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLID</name>
              <description>GAFLID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL11M</name>
          <displayName>CFDGAFL11M</displayName>
          <description>no description</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDEM</name>
              <description>GAFLIDEM field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTRM</name>
              <description>GAFLRTRM field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIFL1</name>
              <description>GAFLIFL1 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIDM</name>
              <description>GAFLIDM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL11P0</name>
          <displayName>CFDGAFL11P0</displayName>
          <description>no description</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLPTR</name>
              <description>GAFLPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>GAFLRMV</name>
              <description>GAFLRMV field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRMDP</name>
              <description>GAFLRMDP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GAFLIFL0</name>
              <description>GAFLIFL0 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLDLC</name>
              <description>GAFLDLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL11P1</name>
          <displayName>CFDGAFL11P1</displayName>
          <description>no description</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLFDPH</name>
              <description>GAFLFDPH field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLFDPL</name>
              <description>GAFLFDPL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL12ID</name>
          <displayName>CFDGAFL12ID</displayName>
          <description>no description</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDE</name>
              <description>GAFLIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTR</name>
              <description>GAFLRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLLB</name>
              <description>GAFLLB field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLID</name>
              <description>GAFLID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL12M</name>
          <displayName>CFDGAFL12M</displayName>
          <description>no description</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLIDEM</name>
              <description>GAFLIDEM field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRTRM</name>
              <description>GAFLRTRM field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIFL1</name>
              <description>GAFLIFL1 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLIDM</name>
              <description>GAFLIDM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL12P0</name>
          <displayName>CFDGAFL12P0</displayName>
          <description>no description</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLPTR</name>
              <description>GAFLPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>GAFLRMV</name>
              <description>GAFLRMV field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLRMDP</name>
              <description>GAFLRMDP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GAFLIFL0</name>
              <description>GAFLIFL0 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLDLC</name>
              <description>GAFLDLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGAFL12P1</name>
          <displayName>CFDGAFL12P1</displayName>
          <description>no description</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GAFLFDPH</name>
              <description>GAFLFDPH field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAFLFDPL</name>
              <description>GAFLFDPL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
