Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDGPFL0PM1</name>
          <displayName>CFDGPFL0PM1</displayName>
          <description>no description</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMASK</name>
              <description>FMASK field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1ID</name>
          <displayName>CFDGPFL1ID</displayName>
          <description>no description</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPFLIDE</name>
              <description>GPFLIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLRTR</name>
              <description>GPFLRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLLB</name>
              <description>GPFLLB field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLID</name>
              <description>GPFLID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1M</name>
          <displayName>CFDGPFL1M</displayName>
          <description>no description</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPFLIDEM</name>
              <description>GPFLIDEM field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLRTRM</name>
              <description>GPFLRTRM field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLIFL1</name>
              <description>GPFLIFL1 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLIDM</name>
              <description>GPFLIDM field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1P0</name>
          <displayName>CFDGPFL1P0</displayName>
          <description>no description</description>
          <addressOffset>0x24c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPFLPTR</name>
              <description>GPFLPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>GPFLRMV</name>
              <description>GPFLRMV field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLRMDP</name>
              <description>GPFLRMDP field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>GPFLIFL0</name>
              <description>GPFLIFL0 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLDLC</name>
              <description>GPFLDLC field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1P1</name>
          <displayName>CFDGPFL1P1</displayName>
          <description>no description</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPFLFDPH</name>
              <description>GPFLFDPH field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLFDPL</name>
              <description>GPFLFDPL field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1PT</name>
          <displayName>CFDGPFL1PT</displayName>
          <description>no description</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPFLANDOR</name>
              <description>GPFLANDOR field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLRANG0</name>
              <description>GPFLRANG0 field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLOUT0</name>
              <description>GPFLOUT0 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLOFFSET0</name>
              <description>GPFLOFFSET0 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>GPFLRANG1</name>
              <description>GPFLRANG1 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLOUT1</name>
              <description>GPFLOUT1 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPFLOFFSET1</name>
              <description>GPFLOFFSET1 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1PD0</name>
          <displayName>CFDGPFL1PD0</displayName>
          <description>no description</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATA</name>
              <description>FDATA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1PM0</name>
          <displayName>CFDGPFL1PM0</displayName>
          <description>no description</description>
          <addressOffset>0x25c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMASK</name>
              <description>FMASK field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1PD1</name>
          <displayName>CFDGPFL1PD1</displayName>
          <description>no description</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDATA</name>
              <description>FDATA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDGPFL1PM1</name>
          <displayName>CFDGPFL1PM1</displayName>
          <description>no description</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FMASK</name>
              <description>FMASK field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC0</name>
          <displayName>CFDRPGACC0</displayName>
          <description>no description</description>
          <addressOffset>0x280</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC1</name>
          <displayName>CFDRPGACC1</displayName>
          <description>no description</description>
          <addressOffset>0x284</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC2</name>
          <displayName>CFDRPGACC2</displayName>
          <description>no description</description>
          <addressOffset>0x288</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC3</name>
          <displayName>CFDRPGACC3</displayName>
          <description>no description</description>
          <addressOffset>0x28c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC4</name>
          <displayName>CFDRPGACC4</displayName>
          <description>no description</description>
          <addressOffset>0x290</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC5</name>
          <displayName>CFDRPGACC5</displayName>
          <description>no description</description>
          <addressOffset>0x294</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC6</name>
          <displayName>CFDRPGACC6</displayName>
          <description>no description</description>
          <addressOffset>0x298</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC7</name>
          <displayName>CFDRPGACC7</displayName>
          <description>no description</description>
          <addressOffset>0x29c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC8</name>
          <displayName>CFDRPGACC8</displayName>
          <description>no description</description>
          <addressOffset>0x2a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC9</name>
          <displayName>CFDRPGACC9</displayName>
          <description>no description</description>
          <addressOffset>0x2a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC10</name>
          <displayName>CFDRPGACC10</displayName>
          <description>no description</description>
          <addressOffset>0x2a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC11</name>
          <displayName>CFDRPGACC11</displayName>
          <description>no description</description>
          <addressOffset>0x2ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC12</name>
          <displayName>CFDRPGACC12</displayName>
          <description>no description</description>
          <addressOffset>0x2b0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC13</name>
          <displayName>CFDRPGACC13</displayName>
          <description>no description</description>
          <addressOffset>0x2b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC14</name>
          <displayName>CFDRPGACC14</displayName>
          <description>no description</description>
          <addressOffset>0x2b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC15</name>
          <displayName>CFDRPGACC15</displayName>
          <description>no description</description>
          <addressOffset>0x2bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC16</name>
          <displayName>CFDRPGACC16</displayName>
          <description>no description</description>
          <addressOffset>0x2c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC17</name>
          <displayName>CFDRPGACC17</displayName>
          <description>no description</description>
          <addressOffset>0x2c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC18</name>
          <displayName>CFDRPGACC18</displayName>
          <description>no description</description>
          <addressOffset>0x2c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC19</name>
          <displayName>CFDRPGACC19</displayName>
          <description>no description</description>
          <addressOffset>0x2cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC20</name>
          <displayName>CFDRPGACC20</displayName>
          <description>no description</description>
          <addressOffset>0x2d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC21</name>
          <displayName>CFDRPGACC21</displayName>
          <description>no description</description>
          <addressOffset>0x2d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRPGACC22</name>
          <displayName>CFDRPGACC22</displayName>
          <description>no description</description>
          <addressOffset>0x2d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDTA</name>
              <description>RDTA field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
