Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDRM19DF15</name>
          <displayName>CFDRM19DF15</displayName>
          <description>no description</description>
          <addressOffset>0x124c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20ID</name>
          <displayName>CFDRM20ID</displayName>
          <description>no description</description>
          <addressOffset>0x1250</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20PTR</name>
          <displayName>CFDRM20PTR</displayName>
          <description>no description</description>
          <addressOffset>0x1254</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20FDSTS</name>
          <displayName>CFDRM20FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0x1258</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF0</name>
          <displayName>CFDRM20DF0</displayName>
          <description>no description</description>
          <addressOffset>0x125c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF1</name>
          <displayName>CFDRM20DF1</displayName>
          <description>no description</description>
          <addressOffset>0x1260</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF2</name>
          <displayName>CFDRM20DF2</displayName>
          <description>no description</description>
          <addressOffset>0x1264</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF3</name>
          <displayName>CFDRM20DF3</displayName>
          <description>no description</description>
          <addressOffset>0x1268</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF4</name>
          <displayName>CFDRM20DF4</displayName>
          <description>no description</description>
          <addressOffset>0x126c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF5</name>
          <displayName>CFDRM20DF5</displayName>
          <description>no description</description>
          <addressOffset>0x1270</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF6</name>
          <displayName>CFDRM20DF6</displayName>
          <description>no description</description>
          <addressOffset>0x1274</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF7</name>
          <displayName>CFDRM20DF7</displayName>
          <description>no description</description>
          <addressOffset>0x1278</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF8</name>
          <displayName>CFDRM20DF8</displayName>
          <description>no description</description>
          <addressOffset>0x127c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF9</name>
          <displayName>CFDRM20DF9</displayName>
          <description>no description</description>
          <addressOffset>0x1280</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF10</name>
          <displayName>CFDRM20DF10</displayName>
          <description>no description</description>
          <addressOffset>0x1284</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF11</name>
          <displayName>CFDRM20DF11</displayName>
          <description>no description</description>
          <addressOffset>0x1288</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF12</name>
          <displayName>CFDRM20DF12</displayName>
          <description>no description</description>
          <addressOffset>0x128c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF13</name>
          <displayName>CFDRM20DF13</displayName>
          <description>no description</description>
          <addressOffset>0x1290</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF14</name>
          <displayName>CFDRM20DF14</displayName>
          <description>no description</description>
          <addressOffset>0x1294</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM20DF15</name>
          <displayName>CFDRM20DF15</displayName>
          <description>no description</description>
          <addressOffset>0x1298</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21ID</name>
          <displayName>CFDRM21ID</displayName>
          <description>no description</description>
          <addressOffset>0x129c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21PTR</name>
          <displayName>CFDRM21PTR</displayName>
          <description>no description</description>
          <addressOffset>0x12a0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21FDSTS</name>
          <displayName>CFDRM21FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0x12a4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF0</name>
          <displayName>CFDRM21DF0</displayName>
          <description>no description</description>
          <addressOffset>0x12a8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF1</name>
          <displayName>CFDRM21DF1</displayName>
          <description>no description</description>
          <addressOffset>0x12ac</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF2</name>
          <displayName>CFDRM21DF2</displayName>
          <description>no description</description>
          <addressOffset>0x12b0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF3</name>
          <displayName>CFDRM21DF3</displayName>
          <description>no description</description>
          <addressOffset>0x12b4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF4</name>
          <displayName>CFDRM21DF4</displayName>
          <description>no description</description>
          <addressOffset>0x12b8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF5</name>
          <displayName>CFDRM21DF5</displayName>
          <description>no description</description>
          <addressOffset>0x12bc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF6</name>
          <displayName>CFDRM21DF6</displayName>
          <description>no description</description>
          <addressOffset>0x12c0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF7</name>
          <displayName>CFDRM21DF7</displayName>
          <description>no description</description>
          <addressOffset>0x12c4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF8</name>
          <displayName>CFDRM21DF8</displayName>
          <description>no description</description>
          <addressOffset>0x12c8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF9</name>
          <displayName>CFDRM21DF9</displayName>
          <description>no description</description>
          <addressOffset>0x12cc</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM21DF10</name>
          <displayName>CFDRM21DF10</displayName>
          <description>no description</description>
          <addressOffset>0x12d0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
