Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>CFDRM27FDSTS</name>
          <displayName>CFDRM27FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0x160c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF0</name>
          <displayName>CFDRM27DF0</displayName>
          <description>no description</description>
          <addressOffset>0x1610</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF1</name>
          <displayName>CFDRM27DF1</displayName>
          <description>no description</description>
          <addressOffset>0x1614</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF2</name>
          <displayName>CFDRM27DF2</displayName>
          <description>no description</description>
          <addressOffset>0x1618</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF3</name>
          <displayName>CFDRM27DF3</displayName>
          <description>no description</description>
          <addressOffset>0x161c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF4</name>
          <displayName>CFDRM27DF4</displayName>
          <description>no description</description>
          <addressOffset>0x1620</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF5</name>
          <displayName>CFDRM27DF5</displayName>
          <description>no description</description>
          <addressOffset>0x1624</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF6</name>
          <displayName>CFDRM27DF6</displayName>
          <description>no description</description>
          <addressOffset>0x1628</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF7</name>
          <displayName>CFDRM27DF7</displayName>
          <description>no description</description>
          <addressOffset>0x162c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF8</name>
          <displayName>CFDRM27DF8</displayName>
          <description>no description</description>
          <addressOffset>0x1630</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF9</name>
          <displayName>CFDRM27DF9</displayName>
          <description>no description</description>
          <addressOffset>0x1634</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF10</name>
          <displayName>CFDRM27DF10</displayName>
          <description>no description</description>
          <addressOffset>0x1638</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF11</name>
          <displayName>CFDRM27DF11</displayName>
          <description>no description</description>
          <addressOffset>0x163c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF12</name>
          <displayName>CFDRM27DF12</displayName>
          <description>no description</description>
          <addressOffset>0x1640</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF13</name>
          <displayName>CFDRM27DF13</displayName>
          <description>no description</description>
          <addressOffset>0x1644</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF14</name>
          <displayName>CFDRM27DF14</displayName>
          <description>no description</description>
          <addressOffset>0x1648</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM27DF15</name>
          <displayName>CFDRM27DF15</displayName>
          <description>no description</description>
          <addressOffset>0x164c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28ID</name>
          <displayName>CFDRM28ID</displayName>
          <description>no description</description>
          <addressOffset>0x1650</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMIDE</name>
              <description>RMIDE field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMRTR</name>
              <description>RMRTR field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMID</name>
              <description>RMID field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28PTR</name>
          <displayName>CFDRM28PTR</displayName>
          <description>no description</description>
          <addressOffset>0x1654</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDLC</name>
              <description>RMDLC field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>RMTS</name>
              <description>RMTS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28FDSTS</name>
          <displayName>CFDRM28FDSTS</displayName>
          <description>no description</description>
          <addressOffset>0x1658</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMPTR</name>
              <description>RMPTR field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>RMIFL</name>
              <description>RMIFL field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>RMFDF</name>
              <description>RMFDF field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMBRS</name>
              <description>RMBRS field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RMESI</name>
              <description>RMESI field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF0</name>
          <displayName>CFDRM28DF0</displayName>
          <description>no description</description>
          <addressOffset>0x165c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF1</name>
          <displayName>CFDRM28DF1</displayName>
          <description>no description</description>
          <addressOffset>0x1660</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF2</name>
          <displayName>CFDRM28DF2</displayName>
          <description>no description</description>
          <addressOffset>0x1664</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF3</name>
          <displayName>CFDRM28DF3</displayName>
          <description>no description</description>
          <addressOffset>0x1668</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF4</name>
          <displayName>CFDRM28DF4</displayName>
          <description>no description</description>
          <addressOffset>0x166c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF5</name>
          <displayName>CFDRM28DF5</displayName>
          <description>no description</description>
          <addressOffset>0x1670</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF6</name>
          <displayName>CFDRM28DF6</displayName>
          <description>no description</description>
          <addressOffset>0x1674</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF7</name>
          <displayName>CFDRM28DF7</displayName>
          <description>no description</description>
          <addressOffset>0x1678</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF8</name>
          <displayName>CFDRM28DF8</displayName>
          <description>no description</description>
          <addressOffset>0x167c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF9</name>
          <displayName>CFDRM28DF9</displayName>
          <description>no description</description>
          <addressOffset>0x1680</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF10</name>
          <displayName>CFDRM28DF10</displayName>
          <description>no description</description>
          <addressOffset>0x1684</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF11</name>
          <displayName>CFDRM28DF11</displayName>
          <description>no description</description>
          <addressOffset>0x1688</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF12</name>
          <displayName>CFDRM28DF12</displayName>
          <description>no description</description>
          <addressOffset>0x168c</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF13</name>
          <displayName>CFDRM28DF13</displayName>
          <description>no description</description>
          <addressOffset>0x1690</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFDRM28DF14</name>
          <displayName>CFDRM28DF14</displayName>
          <description>no description</description>
          <addressOffset>0x1694</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RMDB</name>
              <description>RMDB field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
