Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40000c40</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x40000c80</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <baseAddress>0x40000cc0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOE</name>
      <baseAddress>0x40000d00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <baseAddress>0x40000d40</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOG</name>
      <baseAddress>0x40000d80</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOH</name>
      <baseAddress>0x40000dc0</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOI</name>
      <baseAddress>0x40000e00</baseAddress>
    </peripheral>
    <peripheral>
      <name>GPIO</name>
      <description>GPIO module information</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x40000e40</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xe0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WKUPX</name>
        <description>WKUPX interrupt</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>EXTI_DAC</name>
        <description>EXTI_DAC interrupt</description>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>EXTIEDSA</name>
          <displayName>EXTIEDSA</displayName>
          <description>External Interrupt Edge Select and Enable RegisterA</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSB</name>
          <displayName>EXTIEDSB</displayName>
          <description>External Interrupt Edge Select and Enable RegisterB</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSC</name>
          <displayName>EXTIEDSC</displayName>
          <description>External Interrupt Edge Select and Enable RegisterC</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSD</name>
          <displayName>EXTIEDSD</displayName>
          <description>External Interrupt Edge Select and Enable RegisterD</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSE</name>
          <displayName>EXTIEDSE</displayName>
          <description>External Interrupt Edge Select and Enable RegisterE</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
