Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>EXTIEDSF</name>
          <displayName>EXTIEDSF</displayName>
          <description>External Interrupt Edge Select and Enable RegisterF</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSG</name>
          <displayName>EXTIEDSG</displayName>
          <description>External Interrupt Edge Select and Enable RegisterG</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSH</name>
          <displayName>EXTIEDSH</displayName>
          <description>External Interrupt Edge Select and Enable RegisterH</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIEDSI</name>
          <displayName>EXTIEDSI</displayName>
          <description>External Interrupt Edge Select and Enable RegisterI</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>EXTI15_EDS</name>
              <description>EXTI15_EDS field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI14_EDS</name>
              <description>EXTI14_EDS field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI13_EDS</name>
              <description>EXTI13_EDS field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI12_EDS</name>
              <description>EXTI12_EDS field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI11_EDS</name>
              <description>EXTI11_EDS field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI10_EDS</name>
              <description>EXTI10_EDS field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI9_EDS</name>
              <description>EXTI9_EDS field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI8_EDS</name>
              <description>EXTI8_EDS field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI7_EDS</name>
              <description>EXTI7_EDS field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI6_EDS</name>
              <description>EXTI6_EDS field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI5_EDS</name>
              <description>EXTI5_EDS field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI4_EDS</name>
              <description>EXTI4_EDS field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI3_EDS</name>
              <description>EXTI3_EDS field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI2_EDS</name>
              <description>EXTI2_EDS field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI1_EDS</name>
              <description>EXTI1_EDS field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTI0_EDS</name>
              <description>EXTI0_EDS field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
