Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/CMSIS_Packs_GCC/Keil/FMSH/FM33FG0XXA_DFP/0.0.6/SVD/FM33FG0XXA.SVD
        <register>
          <name>EXTIISRCD</name>
          <displayName>EXTIISRCD</displayName>
          <description>External Interrupt and Status Register CD</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTIISR_PD15</name>
              <description>EXTIISR_PD15 field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD14</name>
              <description>EXTIISR_PD14 field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD13</name>
              <description>EXTIISR_PD13 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD12</name>
              <description>EXTIISR_PD12 field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD11</name>
              <description>EXTIISR_PD11 field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD10</name>
              <description>EXTIISR_PD10 field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD9</name>
              <description>EXTIISR_PD9 field description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD8</name>
              <description>EXTIISR_PD8 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD7</name>
              <description>EXTIISR_PD7 field description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD6</name>
              <description>EXTIISR_PD6 field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD5</name>
              <description>EXTIISR_PD5 field description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD4</name>
              <description>EXTIISR_PD4 field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD3</name>
              <description>EXTIISR_PD3 field description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD2</name>
              <description>EXTIISR_PD2 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD1</name>
              <description>EXTIISR_PD1 field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PD0</name>
              <description>EXTIISR_PD0 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC15</name>
              <description>EXTIISR_PC15 field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC14</name>
              <description>EXTIISR_PC14 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC13</name>
              <description>EXTIISR_PC13 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC12</name>
              <description>EXTIISR_PC12 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC11</name>
              <description>EXTIISR_PC11 field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC10</name>
              <description>EXTIISR_PC10 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC9</name>
              <description>EXTIISR_PC9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC8</name>
              <description>EXTIISR_PC8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC7</name>
              <description>EXTIISR_PC7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC6</name>
              <description>EXTIISR_PC6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC5</name>
              <description>EXTIISR_PC5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC4</name>
              <description>EXTIISR_PC4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC3</name>
              <description>EXTIISR_PC3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC2</name>
              <description>EXTIISR_PC2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC1</name>
              <description>EXTIISR_PC1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PC0</name>
              <description>EXTIISR_PC0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIISREF</name>
          <displayName>EXTIISREF</displayName>
          <description>External Interrupt and Status Register EF</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTIISR_PF15</name>
              <description>EXTIISR_PF15 field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF14</name>
              <description>EXTIISR_PF14 field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF13</name>
              <description>EXTIISR_PF13 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF12</name>
              <description>EXTIISR_PF12 field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF11</name>
              <description>EXTIISR_PF11 field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF10</name>
              <description>EXTIISR_PF10 field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF9</name>
              <description>EXTIISR_PF9 field description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF8</name>
              <description>EXTIISR_PF8 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF7</name>
              <description>EXTIISR_PF7 field description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF6</name>
              <description>EXTIISR_PF6 field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF5</name>
              <description>EXTIISR_PF5 field description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF4</name>
              <description>EXTIISR_PF4 field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF3</name>
              <description>EXTIISR_PF3 field description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF2</name>
              <description>EXTIISR_PF2 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF1</name>
              <description>EXTIISR_PF1 field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PF0</name>
              <description>EXTIISR_PF0 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE15</name>
              <description>EXTIISR_PE15 field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE14</name>
              <description>EXTIISR_PE14 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE13</name>
              <description>EXTIISR_PE13 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE12</name>
              <description>EXTIISR_PE12 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE11</name>
              <description>EXTIISR_PE11 field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE10</name>
              <description>EXTIISR_PE10 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE9</name>
              <description>EXTIISR_PE9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE8</name>
              <description>EXTIISR_PE8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE7</name>
              <description>EXTIISR_PE7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE6</name>
              <description>EXTIISR_PE6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE5</name>
              <description>EXTIISR_PE5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE4</name>
              <description>EXTIISR_PE4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE3</name>
              <description>EXTIISR_PE3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE2</name>
              <description>EXTIISR_PE2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE1</name>
              <description>EXTIISR_PE1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PE0</name>
              <description>EXTIISR_PE0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTIISRGH</name>
          <displayName>EXTIISRGH</displayName>
          <description>External Interrupt and Status Register GH</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTIISR_PH15</name>
              <description>EXTIISR_PH15 field description</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH14</name>
              <description>EXTIISR_PH14 field description</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH13</name>
              <description>EXTIISR_PH13 field description</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH12</name>
              <description>EXTIISR_PH12 field description</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH11</name>
              <description>EXTIISR_PH11 field description</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH10</name>
              <description>EXTIISR_PH10 field description</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH9</name>
              <description>EXTIISR_PH9 field description</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH8</name>
              <description>EXTIISR_PH8 field description</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH7</name>
              <description>EXTIISR_PH7 field description</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH6</name>
              <description>EXTIISR_PH6 field description</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH5</name>
              <description>EXTIISR_PH5 field description</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH4</name>
              <description>EXTIISR_PH4 field description</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH3</name>
              <description>EXTIISR_PH3 field description</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH2</name>
              <description>EXTIISR_PH2 field description</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH1</name>
              <description>EXTIISR_PH1 field description</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PH0</name>
              <description>EXTIISR_PH0 field description</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG15</name>
              <description>EXTIISR_PG15 field description</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG14</name>
              <description>EXTIISR_PG14 field description</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG13</name>
              <description>EXTIISR_PG13 field description</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG12</name>
              <description>EXTIISR_PG12 field description</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG11</name>
              <description>EXTIISR_PG11 field description</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG10</name>
              <description>EXTIISR_PG10 field description</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG9</name>
              <description>EXTIISR_PG9 field description</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG8</name>
              <description>EXTIISR_PG8 field description</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG7</name>
              <description>EXTIISR_PG7 field description</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG6</name>
              <description>EXTIISR_PG6 field description</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG5</name>
              <description>EXTIISR_PG5 field description</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG4</name>
              <description>EXTIISR_PG4 field description</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG3</name>
              <description>EXTIISR_PG3 field description</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG2</name>
              <description>EXTIISR_PG2 field description</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG1</name>
              <description>EXTIISR_PG1 field description</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTIISR_PG0</name>
              <description>EXTIISR_PG0 field description</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
